Revit 2027 API
IFCCategoryTemplate.GetOrCreateInSessionTemplate Method
 Gets the in-session non-serializable template or create new.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCCategoryTemplate GetOrCreateInSessionTemplate(
	Document document
)
Public Shared Function GetOrCreateInSessionTemplate (
	document As Document
) As IFCCategoryTemplate
public:
static IFCCategoryTemplate^ GetOrCreateInSessionTemplate(
	Document^ document
)
static member GetOrCreateInSessionTemplate :
        document : Document -> IFCCategoryTemplate
Parameters
document Document
 The document to find the in-session mapping template.
Return Value
IFCCategoryTemplate
 The mapping template, or null if failed to create.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCCategoryTemplate Class
Autodesk.Revit.DB Namespace